
<details><summary>Show Plan</summary>

``` terraform
terraform
module.lambda.null_resource.docker_build: Refreshing state... [id=5862548276566171109]
module.downloads[0].aws_iam_role.downloads_role: Refreshing state... [id=s3_downloads_role]
module.downloads[0].aws_route53_zone.main: Refreshing state... [id=Z03799832ACKUNJ8IZDHB]
module.downloads[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:725604423866:certificate/691b9483-8679-4d94-82e4-c53a2ff634fc]
module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=modl-hello_world]
module.downloads[0].aws_s3_bucket.log_bucket: Refreshing state... [id=curibio-modl-server-access-logs]
module.lambda.aws_s3_bucket.b: Refreshing state... [id=modl-test-data]
module.lambda.null_resource.docker_tag: Refreshing state... [id=9061425206599045229]
module.lambda.null_resource.docker_push: Refreshing state... [id=6004933638252923688]
module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/modl-hello-lambda]
module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=modl-hello-lambda]
module.downloads[0].aws_route53_record.github_verification: Refreshing state... [id=Z03799832ACKUNJ8IZDHB__github-challenge-curibio.www.curibio.com_TXT]
module.downloads[0].aws_route53_record.a_record: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_A]
module.downloads[0].aws_route53_record.mx_record: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_MX]
module.downloads[0].aws_route53_record.sqsp_www: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_www_CNAME]
module.downloads[0].aws_route53_record.sqsp_verify: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_862laeb5r7tfnxngc2mc_CNAME]
module.downloads[0].aws_route53_record.google_site_verification: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_TXT]
module.downloads[0].aws_route53_record.cname_ssl_verification["*.curibio-modl.com"]: Refreshing state... [id=Z03799832ACKUNJ8IZDHB__57b523665a1e9e3baef95f3dc85315ae.curibio-modl.com._CNAME]
module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=modl-hello-lambda]
module.downloads[0].aws_s3_bucket.downloads: Refreshing state... [id=downloads.curibio-modl.com]
module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::725604423866:policy/modl-hello-lambda-logs]
module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=modl-hello-lambda-logs]
module.downloads[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2021-03-16 22:33:28 +0000 UTC]
module.downloads[0].aws_s3_bucket_policy.downloads_policy: Refreshing state... [id=downloads.curibio-modl.com]
module.downloads[0].aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1CI0FY7D89ZVE]
module.downloads[0].aws_iam_role_policy.s3_downloads: Refreshing state... [id=s3_downloads_role:s3_downloads_policy]
module.downloads[0].aws_route53_record.cname: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_downloads.curibio-modl.com_CNAME]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.jupyter_notebook[0].aws_cloudfront_distribution.jupyter_sdk_distribution will be created
  + resource "aws_cloudfront_distribution" "jupyter_sdk_distribution" {
      + aliases                        = [
          + "jupyter-sdk.curibio-modl.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "Managed by Terraform"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "website"
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + domain_name = (known after apply)
          + origin_id   = "website"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:725604423866:certificate/691b9483-8679-4d94-82e4-c53a2ff634fc"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.jupyter_notebook[0].aws_route53_record.jupyter_cname will be created
  + resource "aws_route53_record" "jupyter_cname" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "jupyter-sdk.curibio-modl.com"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z03799832ACKUNJ8IZDHB"
    }

  # module.jupyter_notebook[0].aws_s3_bucket.jupyter will be created
  + resource "aws_s3_bucket" "jupyter" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "jupyter-sdk.curibio-modl.com"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
          + routing_rules  = jsonencode(
                [
                  + {
                      + Redirect = {
                          + HostName             = "mybinder.org"
                          + ReplaceKeyPrefixWith = "v2/gh/curibio/jupyter_sdk/v0.13.2?filepath=intro.ipynb"
                        }
                    },
                ]
            )
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

Pusher: @jperson